Revit 2027 API
FabricationPart.ProductOriginalEquipmentManufacture Property
 The product original equipment manufacture (OEM) of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductOriginalEquipmentManufacture { get; }
Public ReadOnly Property ProductOriginalEquipmentManufacture As String
	Get
public:
property String^ ProductOriginalEquipmentManufacture {
	String^ get ();
}
member ProductOriginalEquipmentManufacture : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace